Autodesk.Revit.DB.Analysis.MEPAnalyticalSegment.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Analysis.MEPAnalyticalSegment.Area
The area of the segment profile.
Since:
2024

Autodesk.Revit.DB.Analysis.MEPAnalyticalSegment.DemandFlow
The designed flow value, in ft^3/s.
Since:
2024

Autodesk.Revit.DB.Analysis.MEPAnalyticalSegment.RevitElementId
The id of the owning Revit element.
Since:
2024

Autodesk.Revit.DB.Analysis.MEPAnalyticalSegment.EndNode
The id of the end analytical node.
Since:
2024

Autodesk.Revit.DB.Analysis.MEPAnalyticalSegment.StartNode
The id of the start analytical node.
Since:
2024

Autodesk.Revit.DB.Analysis.MEPAnalyticalSegment.Id
The identity of this segment.
Since:
2024

Autodesk.Revit.DB.Analysis.MEPAnalyticalSegment.Roughness
The roughness of this segment, in ft.
Since:
2024

Autodesk.Revit.DB.Analysis.MEPAnalyticalSegment.InnerDiameter
The inner diameter of this segment, in ft. For rectangular or oval profile, this may be the hydraulic diameter.
Since:
2024

Autodesk.Revit.DB.Analysis.MEPAnalyticalSegment.SegmentType
The analytical segment type.
Since:
2024

Autodesk.Revit.DB.Analysis.MEPAnalyticalSegment.DomainType
The connector domain type of this segment.
Since:
2024

Autodesk.Revit.DB.Analysis.MEPAnalyticalSegment
Represents an analytical segment of the MEP analytical model.
Since:
2024